# SubQuery-Advan
Convert CSV to MySql (import csv ke mysql)

In [2]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine

host = '127.0.0.1'
port = '3306'
username = 'root'
password = ''
database = 'classicmodels'

# create connection to database
engine = create_engine('mysql+pymysql://'+username+':'+password+'@'+host+':'+port+'/'+database)
'''engine = create_engine('mysql+pymysql://root:@localhost:3306/classicmodels')'''

def run(sql):
    df = pd.read_sql_query(sql, engine)
    return df

## Konversi CSV ke DataFrame

In [5]:
# CV to DataFrame to MySQL
df_fromcsv = pd.read_csv('mahasiswa.csv')
df_fromcsv.to_sql(name='mahasiswa', con=engine, if_exists = 'append', index = False)
# if_exists = 'fail'|'replace'|'append'

## Baca Data dalam tabel

In [6]:
# Select all mahasisswa data using run functin (pandas)
# data in dataframe type
df_result = run("SELECT * FROM mahasiswa")
print(df_result)

   ID   Nama
0  11    ANI
1  22   BUDI
2  33  CITRA
3  44  DAMAR
4  55   ESTI

## Lakukan penambahan Data dengan Query

In [11]:
# Insert with Autocommit
engine.execute("INSERT INTO mahasiswa VALUES(77, 'JUJU')")

In [12]:
run("SELECT * FROM mahasiswa")

   ID    Nama
0  11     ANI
1  22    BUDI
2  33   CITRA
3  44   DAMAR
4  55    ESTI
5  66  NAMNAM
6  77    JUJU

### \*Insert dengan variabel

In [15]:
id_mhs = '88'
nama_mhs = 'LAPAN'
engine.execute("INSERT INTO mahasiswa VALUES("+id_mhs+",'"+nama_mhs+"')")

In [16]:
run("SELECT * FROM mahasiswa")

   ID    Nama
0  11     ANI
1  22    BUDI
2  33   CITRA
3  44   DAMAR
4  55    ESTI
5  66  NAMNAM
6  77    JUJU
7  88   LAPAN

## Update Data

In [17]:
engine.execute("UPDATE mahasiswa SET Nama = 'ANDI' WHERE ID = 11")

In [18]:
run("SELECT * FROM mahasiswa")

   ID    Nama
0  11    ANDI
1  22    BUDI
2  33   CITRA
3  44   DAMAR
4  55    ESTI
5  66  NAMNAM
6  77    JUJU
7  88   LAPAN

## DELETE

In [19]:
# Delete with Autocommit
engine.execute("DELETE FROM mahasiswa WHERE ID=44")

In [20]:
run("SELECT * FROM mahasiswa")

   ID    Nama
0  11    ANDI
1  22    BUDI
2  33   CITRA
3  55    ESTI
4  66  NAMNAM
5  77    JUJU
6  88   LAPAN

untuk proses-proses yang aan mengubah data atau tabel seperti insert, update, delete, alter dsb gunakan command <b>Execute</b>

## Export Dataframe ke CSV

In [22]:
df_result = run("SELECT * FROM mahasiswa")
df_result.to_csv('mahasiswa(2).csv', index = False)

## Subquery
query di dalam query

In [23]:
# Menampilkan nama customer yang paymentsnya paling tinggi
run("""
SELECT customerName
FROM customers
WHERE customerNumber = 
    (
        SELECT customerNumber
        FROM payments
        WHERE amount = (SELECT MAX(amount) FROM payments)
    )
""")

             customerName
0  Euro+ Shopping Channel

In [26]:
run("""
SELECT 
    customerName
FROM 
    customers
WHERE 
    customerNumber NOT IN (SELECT DISTINCT customerNumber FROM orders)
""")

                      customerName
0               Havel & Zbyszek Co
1           American Souvenirs Inc
2                Porto Imports Co.
3       Asian Shopping Network, Co
4                  Natürlich Autos
5                    ANG Resellers
6         Messner Shopping Network
7                Franken Gifts, Co
8                BG&E Collectables
9                 Schuyler Imports
10                Der Hund Imports
11       Cramer Spezialitäten, Ltd
12           Asian Treasures, Inc.
13            SAR Distributors, Co
14                 Kommission Auto
15          Lisboa Souveniers, Inc
16           Precious Collectables
17  Stuttgart Collectable Exchange
18        Feuer Online Stores, Inc
19                Warburg Exchange
20             Anton Designs, Ltd.
21             Mit Vergnügen & Co.
22       Kremlin Collectables, Co.
23              Raanan Stores, Inc

### Subquery di dalam FROM
tujuannya ialah membuat tabel sementara yang tidak terdapat tabel dalam database tersebut

In [27]:
run("""
SELECT
    MAX(items), MIN(items), FLOOR(AVG(items))
FROM
    (
        SElECT 
            orderNumber, COUNT(orderNumber) AS items
        FROM
            orderdetails
        GROUP BY orderNumber
    )AS lineitems
""")

   MAX(items)  MIN(items)  FLOOR(AVG(items))
0          18           1                9.0